lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
    /* 19th DWORD */
    struct
    {
        uint32_t mode_8s_8s_8s_disable_seq : 4;
        uint32_t mode_8s_8s_8s_enable_seq : 4;
        uint32_t support_mode_0_8_8 : 1;
        uint32_t mode_0_8_8_exit_method : 6;
        uint32_t mode_0_8_8_entry_method : 4;
        uint32_t octal_enable_requirement : 3;
        uint32_t reserved0 : 9;
    } mode_8_8_info;

    /* 20th DWORD */
    struct
    {
        uint32_t max_speed_without_data_strobe_mode_4s_4s_4s : 4;
        uint32_t max_speed_with_data_strobe_mode_4s_4s_4s : 4;
        uint32_t max_speed_without_data_strobe_mode_4d_4d_4d : 4;
        uint32_t max_speed_with_data_strobe_mode_4d_4d_4d : 4;
        uint32_t max_speed_without_data_strobe_mode_8s_8s_8s : 4;
        uint32_t max_speed_with_data_strobe_mode_8s_8s_8s : 4;
        uint32_t max_speed_without_data_strobe_mode_8d_8d_8d : 4;
        uint32_t max_speed_with_data_strobe_mode_8d_8d_8d : 4;
    } max_operate_speed;
} jedec_basic_flash_param_table_t;

/*! @brief 4Byte Addressing Instruction Table. */
typedef struct _jedec_4byte_addressing_inst_table
{
    /* 1st DWORD */
    struct
    {
        uint32_t support_1_1_1_read : 1;
        uint32_t support_1_1_1_fast_read : 1;
        uint32_t support_1_1_2_fast_read : 1;
        uint32_t support_1_2_2_fast_read : 1;
        uint32_t support_1_1_4_fast_read : 1;
        uint32_t support_1_4_4_fast_read : 1;
        uint32_t support_1_1_1_page_program : 1;
        uint32_t support_1_1_4_page_program : 1;
        uint32_t support_1_4_4_page_program : 1;
        uint32_t support_erase_type1_size : 1;
        uint32_t support_erase_type2_size : 1;
        uint32_t support_erase_type3_size : 1;
        uint32_t support_erase_type4_size : 1;
        uint32_t support_1_1_1_dtr_read : 1;
        uint32_t support_1_2_2_dtr_read : 1;
        uint32_t support_1_4_4_dtr_read : 1;
        uint32_t support_volatile_sector_lock_read_cmd : 1;
        uint32_t support_volatile_sector_lock_write_cmd : 1;
        uint32_t support_nonvolatile_sector_lock_read_cmd : 1;
        uint32_t support_nonvolatile_sector_lock_write_cmd : 1;
        uint32_t support_1_1_8_fast_read : 1;
        uint32_t support_1_8_8_fast_read : 1;
        uint32_t support_1_8_8_dtr_read : 1;
        uint32_t support_1_1_8_page_program : 1;
        uint32_t support_1_8_8_page_program : 1;
        uint32_t reserved : 7;
    } cmd_4byte_support_info;

    /* 2nd DWORD */
    struct
    {
        uint8_t erase_inst[4];
    } erase_inst_info;
} jedec_4byte_addressing_inst_table_t;

/*! @brief xSPI profile 1.0. */
typedef struct _jedec_xspi_profile_1_table
{
    /* 1st DWORD */
    struct
    {
        uint32_t read_fast_wrapped_cmd : 8;
        uint32_t read_fast_cmd : 8;
        uint32_t reserved : 6;
        uint32_t write_reg_cmd_data_bytes : 1;
        uint32_t write_reg_cmd_additional_modifier_bytes : 1;
        uint32_t write_status_cfg_reg_cmd_additional_modifier_bytes : 1;
        uint32_t read_volatile_reg_cmd_latency : 1;
        uint32_t read_nv_reg_cmd_latency : 1;
        uint32_t read_reg_cmd_additional_modifier_bytes : 1;
        uint32_t read_status_reg_cmd_latency : 1;
        uint32_t read_status_reg_cmd_additional_modifier_bytes : 1;
        uint32_t dummy_cycles : 1;
        uint32_t address_bytes : 1;
    } cmd_8d_8d_8d_mode_info;

    /* 2nd DWORD */
    struct
    {
        uint32_t write_nv_reg_cmd : 8;
        uint32_t write_volatile_reg_cmd : 8;
        uint32_t read_nv_reg_cmd : 8;
        uint32_t read_volatile_reg_cmd : 8;
    } cmd_8d_8d_8d_inst;

    /* 3th DWORD */
    struct
    {
        uint32_t reserved1 : 10;
        uint32_t enter_default_protocol : 1;
        uint32_t soft_reset_enter_default_protocol : 1;
        uint32_t reset_enable : 1;
        uint32_t soft_reset : 1;
        uint32_t exit_deep_power_down : 1;
        uint32_t enter_deep_power_down : 1;
        uint32_t write_nv_reg : 1;
        uint32_t write_volatile_reg : 1;
        uint32_t write_reg : 1;
        uint32_t clear_flag_status_reg : 1;
        uint32_t write_status_cfg_reg : 1;
        uint32_t read_nv_reg : 1;
        uint32_t read_volatile_reg : 1;
        uint32_t read_reg : 1;
        uint32_t read_flag_status_reg : 1;
        uint32_t read_cfg_reg : 1;
        uint32_t erase_chip : 1;
        uint32_t erase_32kbytes : 1;
        uint32_t erase_4kbytes : 1;
        uint32_t setup_read_wrap : 1;
        uint32_t read_fast_wrapped : 1;
        uint32_t read_sfdp_8d_8d_8d : 1;
    } cmd_octal_support_info;

    /* 4th DWORD */
    struct
    {
        uint32_t reserved1 : 2;
        uint32_t bit_pattern_200mhz : 5;
        uint32_t dummy_cyclses_200mhz : 5;
        uint32_t reserved2 : 20;
    } dummy_cycles_200mhz_setting;

    /* 5th DWORD */
    struct
    {
        uint32_t reserved1 : 2;
        uint32_t bit_pattern_100mhz : 5;
        uint32_t dummy_cyclses_100mhz : 5;
        uint32_t bit_pattern_133mhz : 5;
        uint32_t dummy_cyclses_133mhz : 5;
        uint32_t bit_pattern_166mhz : 5;
        uint32_t dummy_cyclses_166mhz : 5;
    } dummy_cycles_100_133_166mhz_setting;
} jedec_xspi_profile_1_table_t;

/*! @brief Status, Control and Configuration Register Map. */
typedef struct _jedec_sccr_table
{
    /* 1st DWORD */
    uint32_t volatile_reg_address_offset;

    /* 2nd DWORD */
    uint32_t non_volatile_reg_address_offset;

    /* 3rd DWORD */
    struct
    {
        uint32_t dummy_cycles_1s_1s_1s_backup : 4;
        uint32_t reserved : 2;
        uint32_t dummy_cycles_8d_8d_8d : 4;
        uint32_t dummy_cycles_8s_8s_8s : 4;
        uint32_t dummy_cycles_4d_4d_4d : 4;
        uint32_t dummy_cycles_4s_4s_4s : 4;
        uint32_t dummy_cycles_2s_2s_2s : 4;
        uint32_t dummy_cycles_1s_1s_1s : 2;
        uint32_t address_bytes : 2;
        uint32_t support_wirte_control_cmd : 1;
        uint32_t support_read_control_cmd : 1;
    } volatile_reg_read_write_control_cmd;

