lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
    /* 4th DWORD */
    struct
    {
        uint32_t dummy_cycles_1s_1s_1s_backup : 4;
        uint32_t reserved : 2;
        uint32_t dummy_cycles_8d_8d_8d : 4;
        uint32_t dummy_cycles_8s_8s_8s : 4;
        uint32_t dummy_cycles_4d_4d_4d : 4;
        uint32_t dummy_cycles_4s_4s_4s : 4;
        uint32_t dummy_cycles_2s_2s_2s : 4;
        uint32_t dummy_cycles_1s_1s_1s : 2;
        uint32_t address_bytes : 2;
        uint32_t support_wirte_control_cmd : 1;
        uint32_t support_read_control_cmd : 1;
    } non_volatile_reg_read_write_control_cmd;

    /* 5th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 4;
        uint32_t support_4s_4s_4s : 1;
        uint32_t support_4d_4d_4d : 1;
        uint32_t support_8s_8s_8s : 1;
        uint32_t support_8d_8d_8d : 1;
        uint32_t wip_bit_position : 3;
        uint32_t wip_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t wip_polarity : 1;
        uint32_t wip_available : 1;
    } write_in_progress_info;

    /* 6th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 4;
        uint32_t support_4s_4s_4s : 1;
        uint32_t support_4d_4d_4d : 1;
        uint32_t support_8s_8s_8s : 1;
        uint32_t support_8d_8d_8d : 1;
        uint32_t wel_bit_position : 3;
        uint32_t wel_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t wel_write_access : 1;
        uint32_t wel_polarity : 1;
        uint32_t wel_available : 1;
    } write_enable_info;

    /* 7th DWORD */
    /* program error */
    uint32_t program_error;

    /* 8th DWORD */
    /* erase error */
    uint32_t erase_error;

    /* 9th DWORD */
    /* dummy cycles setting for volatile reg */
    uint32_t yummy_cyclse_volatile;

    /* 10th DWORD */
    /* dummy cycles setting for non-volatile reg */
    uint32_t yummy_cyclse_nonvolatile;

    /* 11th DWORD */
    /* dummy cycles setting for bit patterns */
    uint32_t yummy_cyclse_bit_pattern;

    /* 12th DWORD */
    /* dummy cycles setting for bit patterns */
    uint32_t yummy_cyclse_bit_pattern2;

    /* 13th DWORD */
    /* dummy cycles setting for bit patterns */
    uint32_t yummy_cyclse_bit_pattern3;

    /* 14th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t qpi_bit_position : 3;
        uint32_t qpi_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t qpi_polarity : 1;
        uint32_t qpi_available : 1;
    } volatile_qpi_enable_info;

    /* 15th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t qpi_bit_position : 3;
        uint32_t qpi_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t qpi_polarity : 1;
        uint32_t qpi_available : 1;
    } non_volatile_qpi_enable_info;

    /* 16th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t octal_bit_position : 3;
        uint32_t octal_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t octal_polarity : 1;
        uint32_t octal_available : 1;
    } volatile_octal_enable_info;

    /* 17th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t octal_bit_position : 3;
        uint32_t octal_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t otp_bit : 1;
        uint32_t octal_polarity : 1;
        uint32_t octal_available : 1;
    } non_volatile_octal_enable_info;

    /* 18th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t str_dtr_bit_position : 3;
        uint32_t str_dtr_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t str_dtr_polarity : 1;
        uint32_t str_dtr_available : 1;
    } volatile_str_dtr_enable_info;

    /* 19th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t str_dtr_bit_position : 3;
        uint32_t str_dtr_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t str_dtr_polarity : 1;
        uint32_t str_dtr_available : 1;
    } non_volatile_str_dtr_enable_info;

    /* 20th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t str_octal_bit_position : 3;
        uint32_t str_octal_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t str_octal_polarity : 1;
        uint32_t str_octal_available : 1;
    } volatile_str_octal_enable_info;

    /* 21th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t str_octal_bit_position : 3;
        uint32_t str_octal_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t str_octal_polarity : 1;
        uint32_t str_octal_available : 1;
    } non_volatile_str_octal_enable_info;

    /* 22th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t dtr_octal_bit_position : 3;
        uint32_t dtr_octal_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t dtr_octal_polarity : 1;
        uint32_t dtr_octal_available : 1;
    } volatile_dtr_octal_enable_info;

    /* 23th DWORD */
    struct
    {
        uint32_t write_access_cmd : 8;
        uint32_t read_access_cmd : 8;
        uint32_t dummy_cycle_select : 8;
        uint32_t dtr_octal_bit_position : 3;
        uint32_t dtr_octal_bit_exist : 1;
        uint32_t bit_access_use_addrss : 1;
        uint32_t reserved : 1;
        uint32_t dtr_octal_polarity : 1;
        uint32_t dtr_octal_available : 1;
    } non_volatile_dtr_octal_enable_info;

