lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
static status_t FLEXSPI_NOR_WaitBusBusy(FLEXSPI_Type *base, flexspi_mem_nor_handle_t *handle, uint32_t baseAddr);

static status_t FLEXSPI_NOR_WriteEnable(FLEXSPI_Type *base, flexspi_port_t port, uint32_t baseAddr);

static status_t FLEXSPI_NOR_ParseSFDP(nor_handle_t *handle, flexspi_mem_config_t *config, jedec_info_table_t *tbl);

static status_t FLEXSPI_NOR_GetPageSectorBlockSizeFromSFDP(nor_handle_t *handle,
                                                           jedec_info_table_t *tbl,
                                                           uint32_t *sector_erase_cmd,
                                                           uint32_t *block_erase_cmd);

status_t FLEXSPI_NOR_ExitNoCMDMode(nor_handle_t *handle, flexspi_mem_config_t *config, uint32_t baseAddr);
/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
static void FLEXSPI_NOR_Memset(void *src, uint8_t value, size_t length)
{
    assert(src != NULL);

    uint32_t i;
    volatile uint8_t *p = src;

    for (i = 0U; i < length; i++)
    {
        *p = value;
        p++;
    }
}

static status_t FLEXSPI_NOR_WaitBusBusy(FLEXSPI_Type *base, flexspi_mem_nor_handle_t *handle, uint32_t baseAddr)
{
    /* Wait status ready. */
    bool isBusy = true;
    uint32_t readValue;
    status_t status = kStatus_InvalidArgument;
    flexspi_transfer_t flashXfer;

    flashXfer.deviceAddress = baseAddr;
    flashXfer.port          = handle->port;
    flashXfer.cmdType       = kFLEXSPI_Read;
    flashXfer.SeqNumber     = 1;
    flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READSTATUS;
    flashXfer.data          = &readValue;
    flashXfer.dataSize      = 1;

    do
    {
        status = FLEXSPI_TransferBlocking(base, &flashXfer);

        if (status != kStatus_Success)
        {
            return status;
        }

        if (handle->busyBitPolarity == 0x01U)
        {
            isBusy = (((~readValue) & (0x01UL << handle->busyOffset)) == (0x01UL << handle->busyOffset)) ? true : false;
        }
        else
        {
            isBusy = ((readValue & (0x01UL << handle->busyOffset)) == (0x01UL << handle->busyOffset)) ? true : false;
        }
    } while (isBusy);

    return status;
}

static status_t FLEXSPI_NOR_WriteEnable(FLEXSPI_Type *base, flexspi_port_t port, uint32_t baseAddr)
{
    flexspi_transfer_t flashXfer;
    status_t status = kStatus_InvalidArgument;

    /* Write enable */
    flashXfer.deviceAddress = baseAddr;
    flashXfer.port          = port;
    flashXfer.cmdType       = kFLEXSPI_Command;
    flashXfer.SeqNumber     = 1;
    flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITEENABLE;

    status = FLEXSPI_TransferBlocking(base, &flashXfer);

    return status;
}

static status_t FLEXSPI_NOR_ReadSFDP(FLEXSPI_Type *base, uint32_t address, uint32_t *buffer, uint32_t bytes)
{
    flexspi_transfer_t flashXfer;
    status_t status = kStatus_InvalidArgument;

    flashXfer.deviceAddress = address;
    flashXfer.port          = flexspiMemHandle.port;
    flashXfer.cmdType       = kFLEXSPI_Read;
    flashXfer.SeqNumber     = 1;
    flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READ_SFDP;
    flashXfer.data          = buffer;
    flashXfer.dataSize      = bytes;

    status = FLEXSPI_TransferBlocking(base, &flashXfer);

    return status;
}

/*
 * SFDP Overall Header Structure
 * ---------------------
 * SFDP Header, always located at SFDP offset 0x0. Note that the SFDP space is
 * always read in 3 Byte addressing mode, where the expected SFDP address space
 * layout looks like the following:
 *
 *  ------------------0x00
 *  | SFDP Header        |  (specifying X number of Parameter Headers)
 *  ------------------0x08
 *  | Parameter Header 1 |  (specifying Y Parameter Table Pointer & Length L)
 *  ------------------0x10
 *          - - -
 *  --------------X * 0x08
 *  | Parameter Header X |  (specifying Z Parameter Table Pointer & Length K)
 *  --------(X + 1) * 0x08
 *          - - -
 *  ---------------------Y
 *  | Parameter Table 1  |
 *  -------------------Y+L
 *         - - -
 *  ---------------------Z            Key:    ------start_sfdp_offset
 *  | Parameter Table X  |                    | Region Name         |
 *  -------------------Z+K                    ------limit_sfdp_offset
 */
static status_t FLEXSPI_NOR_ReadSFDPInfo(FLEXSPI_Type *base, jedec_info_table_t *tbl)
{
    assert(tbl != NULL);

    status_t status = kStatus_InvalidArgument;

    do
    {
        /*
         * Read SFDP header
         * ---------------------
         * The SFDP Header is located at address 000000h of the SFDP data structure. It identifies the SFDP
         * Signature, the number of parameter headers, and the SFDP revision numbers.
         */
        sfdp_header_t sfdp_header;
        uint32_t address = 0;

        /* Zero initialization */
        FLEXSPI_NOR_Memset(&sfdp_header, 0, sizeof(sfdp_header));

        status = FLEXSPI_NOR_ReadSFDP(base, 0, (uint32_t *)(void *)&sfdp_header, sizeof(sfdp_header));
        if (status != kStatus_Success)
        {
            break;
        }

        if (sfdp_header.signature != SFDP_JESD216_SIGNATURE || sfdp_header.major_rev != SFDP_JESD216_MAJOR)
        {
            break;
        }

        tbl->standard_version = sfdp_header.minor_rev;

        /* This number is 0-based. Therefore, 0 indicates 1 parameter header. */
        uint8_t parameter_header_number = sfdp_header.param_hdr_num + 1U;

        /*
         * Read parameter headers
         * ---------------------
         * The first parameter header is mandatory, is defined by JEDEC standard, and starts at byte offset 08h.
         */
        sfdp_parameter_header_t sfdp_param_hdrs[12];
        uint8_t max_hdr_count = (parameter_header_number > 10U) ? 10U : parameter_header_number;
        address               = 0x08U;
        uint8_t i;

        /* Zero initialization*/
        FLEXSPI_NOR_Memset(sfdp_param_hdrs, 0, sizeof(sfdp_param_hdrs));

        status = FLEXSPI_NOR_ReadSFDP(base, address, (uint32_t *)(void *)&sfdp_param_hdrs[0],
                                      (uint32_t)max_hdr_count * sizeof(sfdp_parameter_header_t));
        if (status != kStatus_Success)
        {
            break;
        }

        for (i = 0; i < max_hdr_count; i++)
        {
            uint32_t parameter_id = SFDP_PARAM_HEADER_ID(sfdp_param_hdrs[i]);

            address = SFDP_PARAM_HEADER_PTP(sfdp_param_hdrs[i]);

            uint32_t table_size = (uint32_t)sfdp_param_hdrs[i].table_length_in_32bit * sizeof(uint32_t);

            if (parameter_id == (uint32_t)kParameterID_BasicSpiProtocal)
            {
                /* Limit table size to the max supported JEDEC216C standard */
                if (table_size > sizeof(jedec_basic_flash_param_table_t))
                {
                    table_size = sizeof(jedec_basic_flash_param_table_t);
                }

                /* Read Basic SPI Protocol Table */
                status =
                    FLEXSPI_NOR_ReadSFDP(base, address, (uint32_t *)(void *)&tbl->basic_flash_param_tbl, table_size);

                if (status != kStatus_Success)
                {
                    break;
                }

                tbl->basic_flash_param_tbl_size = table_size;
            }
            else if (parameter_id == (uint32_t)kParameterID_4ByteAddressInstructionTable)
            {
                /* Limit table size to the max supported JEDEC216C/D standard */
                if (table_size > sizeof(jedec_4byte_addressing_inst_table_t))
                {
                    table_size = sizeof(jedec_4byte_addressing_inst_table_t);
                }

