lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
                /* Read 4-byte Address Instruction Table */
                status = FLEXSPI_NOR_ReadSFDP(base, address, (uint32_t *)(void *)&tbl->flash_4b_inst_tbl, table_size);
                if (status != kStatus_Success)
                {
                    break;
                }
                tbl->has_4b_addressing_inst_table = true;
            }
            else if (parameter_id == (uint32_t)kParameterID_CommandSeqToOctalDDRMode)
            {
                /* Limit table size to the max supported JEDEC216C/D standard */
                if (table_size > sizeof(jedec_octal_ddr_mode_cmd_table_t))
                {
                    table_size = sizeof(jedec_octal_ddr_mode_cmd_table_t);
                }

                /* Read Command Sequences to change to Octal DDR (8D-8D-8D) mode Instruction Table */
                status = FLEXSPI_NOR_ReadSFDP(base, address, (uint32_t *)(void *)&tbl->octal_ddr_cmd_tb1, table_size);
                if (status != kStatus_Success)
                {
                    break;
                }
            }
            else if (parameter_id == (uint32_t)kParameterID_XSPIProfileVersion1)
            {
                /* Limit table size to the max supported JEDEC216C/D standard */
                if (table_size > sizeof(jedec_xspi_profile_1_table_t))
                {
                    table_size = sizeof(jedec_xspi_profile_1_table_t);
                }

                /* Read eXtended Serial Peripheral Interface (xSPI) Profile 1.0 Table */
                status = FLEXSPI_NOR_ReadSFDP(base, address, (uint32_t *)(void *)&tbl->xspi_profile_1_tb1, table_size);
                if (status != kStatus_Success)
                {
                    break;
                }
            }
            else if (parameter_id == (uint32_t)kParameterID_SCCRM)
            {
                /* Limit table size to the max supported JEDEC216C/D standard */
                if (table_size > sizeof(jedec_xspi_profile_1_table_t))
                {
                    table_size = sizeof(jedec_xspi_profile_1_table_t);
                }

                /* Read Status, Control and Configuration Register Map Table */
                status = FLEXSPI_NOR_ReadSFDP(base, address, (uint32_t *)(void *)&tbl->sccr_tb1, table_size);
                if (status != kStatus_Success)
                {
                    break;
                }
            }
            else if (parameter_id == (uint32_t)kParameterID_SCCRMForxSPIProfileVersion2)
            {
                /* Limit table size to the max supported JEDEC216C/D standard */
                if (table_size > sizeof(jedec_sccr_2_table_t))
                {
                    table_size = sizeof(jedec_sccr_2_table_t);
                }

                /* Read Status, Control and Configuration Register Map Table */
                status = FLEXSPI_NOR_ReadSFDP(base, address, (uint32_t *)(void *)&tbl->sccr_2_tb1, table_size);
                if (status != kStatus_Success)
                {
                    break;
                }
            }
            else
            {
                /* Unsupported function specific parameter type, ignore */
            }
        }

    } while (false);

    return status;
}

static status_t FLEXSPI_NOR_GetPageSectorBlockSizeFromSFDP(nor_handle_t *handle,
                                                           jedec_info_table_t *tbl,
                                                           uint32_t *sector_erase_cmd,
                                                           uint32_t *block_erase_cmd)
{
    assert(handle != NULL);
    assert(tbl != NULL);

    status_t status = kStatus_Success;
    uint32_t flashSize;
    uint32_t page_size;
    uint32_t flashDensity    = tbl->basic_flash_param_tbl.flash_density;
    uint32_t sectorSize      = 0xFFFFU;
    uint32_t blockSize       = 0x00U;
    uint32_t sectorEraseCmd  = 0U;
    uint32_t sectorEraseType = 0U;
    uint32_t blockEraseType  = 0U;
    uint32_t i;
    jedec_basic_flash_param_table_t *param_tbl        = &tbl->basic_flash_param_tbl;
    jedec_4byte_addressing_inst_table_t *flash_4b_tbl = &tbl->flash_4b_inst_tbl;

    if (flashDensity != 0x00U)
    {
        if ((flashDensity & (1UL << 0x1F)) != 0x00U)
        {
            /* Flash size >= 4G bits */
            flashSize = 1UL << (flashDensity & ~(1UL << 0x1F));
        }
        else
        {
            /* Flash size < 4G bits */
            flashSize = flashDensity + 1U;
        }

        /* Convert to bytes. */
        flashSize >>= 3;
        handle->bytesInMemorySize = flashSize;

        /* Calculate Page size */
        if (tbl->basic_flash_param_tbl_size < 64U)
        {
            handle->bytesInPageSize = 256U;
        }
        else
        {
            page_size               = 0x01UL << (param_tbl->chip_erase_progrm_info.page_size);
            handle->bytesInPageSize = (page_size == (0x01UL << 15)) ? 256UL : page_size;
        }

        /* Calculate Sector Size */
        if (param_tbl->misc.support_uniform_4K_erase == 0x01U)
        {
            sectorSize     = 4096U;
            sectorEraseCmd = param_tbl->misc.erase4k_inst;
        }
        else
        {
            for (i = 0U; i < 4U; i++)
            {
                if (param_tbl->erase_info[i].size != 0UL)
                {
                    uint32_t current_erase_size = 1UL << param_tbl->erase_info[i].size;
                    /* Calculate min non-zero sector size */
                    if ((current_erase_size < sectorSize) && (current_erase_size < (1024U * 1024U)))
                    {
                        sectorSize      = current_erase_size;
                        sectorEraseType = i;
                    }
                }
            }

            sectorEraseCmd = param_tbl->erase_info[sectorEraseType].inst;
        }

        /* Calculate Block Size */
        for (i = 0U; i < 4U; i++)
        {
            if (param_tbl->erase_info[i].size != 0UL)
            {
                uint32_t current_erase_size = 1UL << param_tbl->erase_info[i].size;

