lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
            if (config->transferMode == kSerialNorTransferMode_DDR)
            {
                isSDRMode = false;
            }
            else
            {
                isSDRMode = true;
            }

            uint32_t cmdInst  = isSDRMode ? (uint32_t)kFLEXSPI_Command_SDR : (uint32_t)kFLEXSPI_Command_DDR;
            uint32_t addrInst = isSDRMode ? (uint32_t)kFLEXSPI_Command_RADDR_SDR : (uint32_t)kFLEXSPI_Command_RADDR_DDR;
            uint32_t dummyInst =
                isSDRMode ? (uint32_t)kFLEXSPI_Command_DUMMY_SDR : (uint32_t)kFLEXSPI_Command_DUMMY_DDR;
            uint32_t readInst = isSDRMode ? (uint32_t)kFLEXSPI_Command_READ_SDR : (uint32_t)kFLEXSPI_Command_READ_DDR;
            uint32_t writeInst =
                isSDRMode ? (uint32_t)kFLEXSPI_Command_WRITE_SDR : (uint32_t)kFLEXSPI_Command_WRITE_DDR;

            /* Command extension to 16 bits, and start command should be under DDR mode in this situation */
            if (param_tbl->octal_1_8_info.octal_dtr_cmd_and_cmd_extension == 0x01U)
            {
                /* Update write enable LUT table and current command mode for octal mode */
                FLEXSPI_NOR_Memset(&config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE], 0, 4 * 4);
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, 0x06, cmdInst, kFLEXSPI_8PAD, 0xF9);

                /* Set read command instruction for LUT. */
                if (isSDRMode)
                {
                    config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READ] =
                        FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, kOctalSerialNorCmd_Read_8s_8s_8s_4B_1st, cmdInst,
                                        kFLEXSPI_8PAD, kOctalSerialNorCmd_Read_8s_8s_8s_4B_2nd);
                }
                else
                {
                    config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READ] =
                        FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, readCmd, cmdInst, kFLEXSPI_8PAD,
                                        kOctalSerialNorCmd_Read_8d_8d_8d_4B_2nd);
                }
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READ + 1U] =
                    FLEXSPI_LUT_SEQ(addrInst, kFLEXSPI_8PAD, 0x20, dummyInst, kFLEXSPI_8PAD, 10);
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READ + 2U] =
                    FLEXSPI_LUT_SEQ(readInst, kFLEXSPI_8PAD, 0x04, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0x00);

                /* Read status register */
                FLEXSPI_NOR_Memset(&config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READSTATUS], 0, 4 * 4);
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READSTATUS] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, kOctalSerialNorCmd_ReadStatusReg_1st, cmdInst,
                                    kFLEXSPI_8PAD, kOctalSerialNorCmd_ReadStatusReg_2nd);
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READSTATUS + 1U] =
                    FLEXSPI_LUT_SEQ(addrInst, kFLEXSPI_8PAD, 0x20, readInst, kFLEXSPI_8PAD, 0x04);

                /* Program */
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, kOctalSerialNorCmd_PageProgram_4B_1st, cmdInst,
                                    kFLEXSPI_8PAD, kOctalSerialNorCmd_PageProgram_4B_2nd);
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM + 1U] =
                    FLEXSPI_LUT_SEQ(addrInst, kFLEXSPI_8PAD, 0x20, writeInst, kFLEXSPI_8PAD, 0x04);

                /* Erase Sector */
                /* Macronix Sector(4KB) erase is 0x21 and 0xDE */
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_ERASESECTOR] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, kOctalSerialNorCmd_SectorErase_4B_1st, cmdInst,
                                    kFLEXSPI_8PAD, kOctalSerialNorCmd_SectorErase_4B_2nd);
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_ERASESECTOR + 1U] =
                    FLEXSPI_LUT_SEQ(addrInst, kFLEXSPI_8PAD, 0x20, kFLEXSPI_Command_STOP, kFLEXSPI_8PAD, 0x00);

                /* Erase Block */
                /* Macronix Block(64KB) erase is 0xDC and 0x23 */
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_ERASEBLOCK] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, kOctalSerialNorCmd_BlockErase_4B_1st, cmdInst,
                                    kFLEXSPI_8PAD, kOctalSerialNorCmd_BlockErase_4B_2nd);
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_ERASEBLOCK + 1U] =
                    FLEXSPI_LUT_SEQ(addrInst, kFLEXSPI_8PAD, 0x20, kFLEXSPI_Command_STOP, kFLEXSPI_8PAD, 0x00);

                /* Erase Chip */
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_CHIPERASE] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, kOctalSerialNorCmd_ChipErase_1st, cmdInst, kFLEXSPI_8PAD,
                                    kOctalSerialNorCmd_ChipErase_2nd);
            }
            /* No command extension, and start command should be CMD_SDR in this situation */
            else
            {
                /* The reason why make command instruction as CMD_SDR is that it must be in SDR mode if
                   the octal flash timing requires first command instruction. */
                cmdInst = kFLEXSPI_Command_SDR;

                /* Update write enable LUT table and current command mode for octal mode */
                FLEXSPI_NOR_Memset(&config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE], 0, 4 * 4);
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, 0x06, kFLEXSPI_Command_STOP, kFLEXSPI_8PAD, 0);

                /* Set read command instruction for LUT. */
                /* Adesto 4B read instruction is readCmd(0x0B) for both SDR and DDR in octal mode, 0x03 is for 3B single
                 * mode and 0x13 is for 4B single mode */
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READ] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, readCmd, addrInst, kFLEXSPI_8PAD, 0x20);
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READ + 1U] =
                    FLEXSPI_LUT_SEQ(dummyInst, kFLEXSPI_8PAD, 8, readInst, kFLEXSPI_8PAD, 0x04);

                /* Read status register */
                FLEXSPI_NOR_Memset(&config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READSTATUS], 0, 4 * 4);
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READSTATUS] = FLEXSPI_LUT_SEQ(
                    cmdInst, kFLEXSPI_8PAD, kOctalSerialNorCmd_ReadStatusReg_1st, readInst, kFLEXSPI_8PAD, 0x04);

                /* Program */
                /* Adesto 4B program instruction is 0x02, but others is 3B program instruction is 0x02 and 4B program
                 * instruction is 0x12 */
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, 0x02, addrInst, kFLEXSPI_8PAD, 0x20);
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM + 1U] =
                    FLEXSPI_LUT_SEQ(writeInst, kFLEXSPI_8PAD, 0x04, kFLEXSPI_Command_STOP, kFLEXSPI_8PAD, 0x00);

                /* Erase Sector */
                /* Adesto Sector(4KB) erase is 0x20, which aligns with SFDP erase information */
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_ERASESECTOR] =
                    FLEXSPI_LUT_SEQ(cmdInst, kFLEXSPI_8PAD, sectorEraseCmd, addrInst, kFLEXSPI_8PAD, 0x20);

