lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
            /* Quad flash is running at quad mode, no need to enable it again. */
            if (true != isQuadMode)
            {
                runContext.statusVal = statusVal;
                /* Enable Quad mode if status register's corresponding QE bit is 0. */
                status = FLEXSPI_NOR_EnableQuadMode(handle, config, &runContext);
            }
        }
    } while (false);

    return status;
}

static status_t FLEXSPI_NOR_EnableQuadMode(nor_handle_t *handle, flexspi_mem_config_t *config, run_context_t *context)
{
    assert(handle != NULL);
    assert(config != NULL);

    flexspi_transfer_t flashXfer;
    flexspi_mem_nor_handle_t *memHandle = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    status_t status                     = kStatus_InvalidArgument;
    flexspi_port_t port                 = memHandle->port;
    uint32_t writeValue                 = context->statusVal;

    /* Set write enable command instruction for LUT. */
    config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE] = FLEXSPI_LUT_SEQ(
        kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, kSerialNorCmd_WriteEnable, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0);

    /* Update LUT table. */
    FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITEENABLE * 4U,
                      &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE], 4);

    /* Write enable. */
    status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, 0);

    if (status == kStatus_Success)
    {
        /* Enable quad mode. */
        flashXfer.deviceAddress = 0;
        flashXfer.port          = port;
        flashXfer.cmdType       = kFLEXSPI_Write;
        flashXfer.SeqNumber     = 1;
        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITESTATUS;
        flashXfer.data          = &writeValue;
        flashXfer.dataSize      = context->lengthInByte;

        status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);
        if (status == kStatus_Success)
        {
            status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, 0);
        }
    }

    return status;
}

static status_t FLEXSPI_NOR_PreEnterOctalMode(nor_handle_t *handle,
                                              flexspi_mem_config_t *config,
                                              jedec_info_table_t *tbl)
{
    assert(handle != NULL);
    assert(config != NULL);
    assert(tbl != NULL);

    status_t status         = kStatus_Success;
    uint32_t manufacturerId = tbl->manufacturerId;

    /* Enter octal mode based on manufacture ID */
    switch (manufacturerId)
    {
        case kSerialNorFlash_MacronixManufacturerID:
            status = FLEXSPI_NOR_MacronixEnterOctalMode(handle, config, tbl);
            break;

        case kSerialNorFlash_Adesto32ManufacturerID:
            SUPPRESS_FALL_THROUGH_WARNING();
        case kSerialNorFlash_Adesto128ManufacturerID:
            status = FLEXSPI_NOR_AdestoEnterOctalMode(handle, config, tbl);
            break;

        default:
            assert(false);
            break;
    }

    return status;
}

static status_t FLEXSPI_NOR_ExitQuadMode(nor_handle_t *handle, flexspi_mem_config_t *config, jedec_info_table_t *tbl)
{
    assert(handle != NULL);
    assert(config != NULL);
    assert(tbl != NULL);

    status_t status = kStatus_Success;
    uint8_t seqNumber;
    flexspi_transfer_t flashXfer;
    flexspi_mem_nor_handle_t *memHandle              = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                              = memHandle->port;
    jedec_basic_flash_param_table_t *basicFlashTable = &tbl->basic_flash_param_tbl;

    /* Exit quad mode through issuing the soft reset command.*/
    if ((basicFlashTable->mode_4_4_info.mode_4_4_4_disable_seq & 0x08U) == 0x08U)
    {
        if ((basicFlashTable->mode_config_info.soft_reset_rescue_support & 0x10U) == 0x10U)
        {
            FLEXSPI_NOR_Memset(&config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U], 0, 4 * 4);

            if (config->transferMode == kSerialNorTransferMode_SDR)
            {
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, 0x66U, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0x00U);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U + 0x04U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, 0x99U, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0x00U);
            }
            else
            {
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_DDR, kFLEXSPI_1PAD, 0x66U, kFLEXSPI_Command_DDR, kFLEXSPI_1PAD, 0x00U);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U + 0x04U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, 0x99U, kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, 0x00U);
            }

            seqNumber = 0x02U;
        }
        else
        {
            /* TBD: other methods to exit quad mode into standard SPI mode */
            status = kStatus_FLEXSPINOR_RestoreStandardSPIModeFailed;
        }
    }
    else
    {
        status = kStatus_FLEXSPINOR_RestoreStandardSPIModeFailed;
    }

    if (status == kStatus_Success)
    {
        FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U,
                          &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITECONFIG], 4UL * (uint32_t)seqNumber);

        flashXfer.deviceAddress = 0;
        flashXfer.port          = port;
        flashXfer.cmdType       = kFLEXSPI_Command;
        flashXfer.SeqNumber     = seqNumber;
        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITECONFIG;

        status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

        if (status == kStatus_Success)
        {
            config->CurrentCommandMode = kSerialNorCommandMode_1_1_1;
        }
    }

