lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
    return status;
}

static status_t FLEXSPI_NOR_MacronixExitOctalMode(nor_handle_t *handle,
                                                  flexspi_mem_config_t *config,
                                                  jedec_info_table_t *tbl)
{
    assert(handle != NULL);
    assert(config != NULL);
    assert(tbl != NULL);

    status_t status = kStatus_Success;
    flexspi_transfer_t flashXfer;
    flexspi_mem_nor_handle_t *memHandle              = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                              = memHandle->port;
    jedec_basic_flash_param_table_t *basicFlashTable = &tbl->basic_flash_param_tbl;

    /* Exit octal mode through issuing the soft reset command. Details in the 19th DWORD, JEDEC basic flash parameter
     * table.*/
    if ((basicFlashTable->mode_8_8_info.mode_8s_8s_8s_disable_seq & 0x08U) == 0x08U)
    {
        FLEXSPI_NOR_Memset(&config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U], 0, 4 * 8);

        if (config->transferMode == kSerialNorTransferMode_SDR)
        {
            config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U] =
                FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x66, kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x99);
            config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U + 4U] =
                FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x99, kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x66);
        }
        else
        {
            config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U] =
                FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x66, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x99);
            config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U + 4U] =
                FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x99, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x66);
        }

        FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U,
                          &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITECONFIG], 8);

        flashXfer.deviceAddress = 0;
        flashXfer.port          = port;
        flashXfer.cmdType       = kFLEXSPI_Command;
        flashXfer.SeqNumber     = 2;
        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITECONFIG;

        status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

        if (status != kStatus_Success)
        {
            return status;
        }

        /* Update RX sample clock source: disable DQS and read strobe.*/
        ((FLEXSPI_Type *)handle->driverBaseAddr)->MCR0 &= ~FLEXSPI_MCR0_RXCLKSRC_MASK;
        ((FLEXSPI_Type *)handle->driverBaseAddr)->MCR0 |=
            FLEXSPI_MCR0_RXCLKSRC(kFLEXSPI_ReadSampleClkLoopbackFromDqsPad);
    }
    else
    {
        /* TODO: for xxx1b with issue command */
        status = kStatus_FLEXSPINOR_UnsupportedOctalModeEnterMethod;
    }

    if (status == kStatus_Success)
    {
        config->CurrentCommandMode = kSerialNorCommandMode_1_1_1;
    }

    /* Delay for software reset recovery, which is 100ms for all operations, such as read/program/erase on macronix
     * octal flash. */
    SDK_DelayAtLeastUs(100000, SystemCoreClock);

    return status;
}

static status_t FLEXSPI_NOR_CheckCommandModeAvailability(nor_handle_t *handle,
                                                         flexspi_mem_config_t *config,
                                                         jedec_info_table_t *tbl)
{
    assert(handle != NULL);
    assert(config != NULL);
    assert(tbl != NULL);

    status_t status                     = kStatus_Success;
    flexspi_mem_nor_handle_t *memHandle = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                 = memHandle->port;
    uint8_t readValue[4]                = {0x55U, 0x55U, 0x55U, 0x55U};
    uint8_t currentCommandMode          = (uint8_t)config->CurrentCommandMode;
    uint32_t readConfigRegCmd           = tbl->xspi_profile_1_tb1.cmd_8d_8d_8d_inst.read_volatile_reg_cmd;
    uint32_t manufacturerId             = tbl->manufacturerId;
    flexspi_transfer_t flashXfer;

    FLEXSPI_NOR_Memset(&config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U], 0, 4U * 4U);

    if (manufacturerId == (uint32_t)kSerialNorFlash_MacronixManufacturerID)
    {
        /* Command extension to 16 bits */
        if (tbl->basic_flash_param_tbl.octal_1_8_info.octal_dtr_cmd_and_cmd_extension == 0x01U)
        {
            /* Read configuration register 2 */
            if (currentCommandMode == (uint8_t)kSerialNorCommandMode_8d_8d_8d)
            {
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, readConfigRegCmd, kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x8E);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U + 1U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_RADDR_DDR, kFLEXSPI_8PAD, 0x20, kFLEXSPI_Command_READ_DDR, kFLEXSPI_8PAD, 0x04);
            }
            else if (currentCommandMode == (uint8_t)kSerialNorCommandMode_8s_8s_8s)
            {
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, readConfigRegCmd, kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x8E);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U + 1U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_RADDR_SDR, kFLEXSPI_8PAD, 0x20, kFLEXSPI_Command_READ_SDR, kFLEXSPI_8PAD, 0x04);
            }
            else if (currentCommandMode == (uint8_t)kSerialNorCommandMode_1_1_1)
            {
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U] =
                    FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, readConfigRegCmd, kFLEXSPI_Command_RADDR_SDR,
                                    kFLEXSPI_1PAD, 0x20);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4U + 1U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_READ_SDR, kFLEXSPI_1PAD, 0x04, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0);
            }
            else
            {
                ; /* TBD */
            }

            FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READCONFIG * 4UL,
                              &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_READCONFIG], 4);

