lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
    return status;
}

static status_t FLEXSPI_NOR_AdestoEnterOctalMode(nor_handle_t *handle,
                                                 flexspi_mem_config_t *config,
                                                 jedec_info_table_t *tbl)
{
    assert(handle != NULL);
    assert(config != NULL);
    assert(tbl != NULL);

    status_t status = kStatus_Success;
    flexspi_transfer_t flashXfer;
    flexspi_mem_nor_handle_t *memHandle              = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                              = memHandle->port;
    uint32_t enableDdrMode                           = 0x88U;
    jedec_basic_flash_param_table_t *basicFlashTable = &tbl->basic_flash_param_tbl;
    uint32_t lut_seq[4];

    FLEXSPI_NOR_Memset(lut_seq, 0, sizeof(lut_seq));

    /* Enter octal mode through issue command, details in JEDEC basic flash parameter table 19th DWORD */
    if ((basicFlashTable->mode_8_8_info.mode_8s_8s_8s_enable_seq & 0x02U) == 0x02U)
    {
        /* Enable DQS and read strobe, and make the timing input source from DQS pad.*/
        ((FLEXSPI_Type *)handle->driverBaseAddr)->MCR0 &= ~FLEXSPI_MCR0_RXCLKSRC_MASK;
        ((FLEXSPI_Type *)handle->driverBaseAddr)->MCR0 |=
            FLEXSPI_MCR0_RXCLKSRC(kFLEXSPI_ReadSampleClkExternalInputFromDqsPad);

        /* Set the command instruction of read status register for LUT in octal sdr mode. */
        lut_seq[0] =
            FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x05, kFLEXSPI_Command_DUMMY_SDR, kFLEXSPI_8PAD, 0x04);
        lut_seq[1] =
            FLEXSPI_LUT_SEQ(kFLEXSPI_Command_READ_SDR, kFLEXSPI_8PAD, 0x04, kFLEXSPI_Command_STOP, kFLEXSPI_8PAD, 0x0);

        /* Enter octal mode */
        status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, 0);

        if (kStatus_Success == status)
        {
            FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READSTATUS * 4UL, lut_seq, 4);

            FLEXSPI_NOR_Memset(&config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U], 0, 4 * 4);
            config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U] =
                FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_1PAD, 0xE8, kFLEXSPI_Command_STOP, kFLEXSPI_1PAD, 0);
            FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4UL,
                              &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITECONFIG], 4);

            flashXfer.deviceAddress = 0;
            flashXfer.port          = port;
            flashXfer.cmdType       = kFLEXSPI_Command;
            flashXfer.SeqNumber     = 1;
            flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITECONFIG;

            status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);
        }

        if (status != kStatus_Success)
        {
            return status;
        }

        status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, 0);

        if (kStatus_Success == status)
        {
            /* Update command mode into 8s-8s-8s mode */
            config->CurrentCommandMode = kSerialNorCommandMode_8s_8s_8s;

            if (config->transferMode == kSerialNorTransferMode_DDR)
            {
                FLEXSPI_NOR_Memset(lut_seq, 0, sizeof(lut_seq));
                /* Set the command instruction of read status register for LUT in octal ddr mode. */
                lut_seq[0] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_DDR, kFLEXSPI_8PAD, 0x05, kFLEXSPI_Command_DUMMY_DDR,
                                             kFLEXSPI_8PAD, 0x03);
                lut_seq[1] = FLEXSPI_LUT_SEQ(kFLEXSPI_Command_READ_DDR, kFLEXSPI_8PAD, 0x04, kFLEXSPI_Command_STOP,
                                             kFLEXSPI_8PAD, 0x0);
                FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READSTATUS * 4UL, lut_seq,
                                  4);

                /* Update write enable LUT table and current command mode for octal sdr mode */
                FLEXSPI_NOR_Memset(&config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE], 0, 4 * 4);
                config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE] =
                    FLEXSPI_LUT_SEQ(kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x06, kFLEXSPI_Command_STOP, kFLEXSPI_8PAD, 0);
                FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITEENABLE * 4U,
                                  &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITEENABLE], 4);

                /* Set the command instruction of write configuration register 2 for LUT in octal sdr mode. */
                FLEXSPI_NOR_Memset(&config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U], 0, 4 * 4);
                config->lookupTable[NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U] = FLEXSPI_LUT_SEQ(
                    kFLEXSPI_Command_SDR, kFLEXSPI_8PAD, 0x31, kFLEXSPI_Command_WRITE_SDR, kFLEXSPI_8PAD, 0x01);
                FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_WRITECONFIG * 4U,
                                  &config->lookupTable[4U * NOR_CMD_LUT_SEQ_IDX_WRITECONFIG], 4);

                status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, 0);

                if (kStatus_Success == status)
                {
                    flashXfer.deviceAddress = 0;
                    flashXfer.port          = port;
                    flashXfer.cmdType       = kFLEXSPI_Write;
                    flashXfer.SeqNumber     = 1;
                    flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_WRITECONFIG;
                    flashXfer.data          = &enableDdrMode;
                    flashXfer.dataSize      = 1;

                    status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);
                }

                if (status != kStatus_Success)
                {
                    return status;
                }

                status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, 0);

                /* Update command mode into 8d-8d-8d */
                config->CurrentCommandMode = kSerialNorCommandMode_8d_8d_8d;
            }
        }
    }
    else
    {
        /* TODO: for x_x1xxb with write config register 2 */
        status = kStatus_FLEXSPINOR_UnsupportedOctalModeEnterMethod;
    }

    if (kStatus_Success == status)
    {
        status = FLEXSPI_NOR_CheckCommandModeAvailability(handle, config, tbl);
    }

