lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
        for (uint8_t i = 0x00U; i < 10U; i++)
        {
            if (0x7FU != id[i])
            {
                jedec_info_tbl.manufacturerId = (uint32_t)id[i];
                break;
            }
        }
        /* Read SFDP information, probe whether the Flash device is present or not. */
        FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_READ_SFDP * 4U,
                          (const uint32_t *)(const void *)&k_sdfp_lut[config->queryPads], 4);
        status = FLEXSPI_NOR_ReadSFDPInfo((FLEXSPI_Type *)handle->driverBaseAddr, &jedec_info_tbl);
        if (status != kStatus_Success)
        {
            break;
        }

        status = FLEXSPI_NOR_ParseSFDP(handle, config, &jedec_info_tbl);

    } while (false);

    return status;
}

status_t Nor_Flash_Erase_Chip(nor_handle_t *handle)
{
    assert(handle != NULL);

    status_t status                     = kStatus_InvalidArgument;
    flexspi_mem_nor_handle_t *memHandle = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                 = memHandle->port;
    flexspi_transfer_t flashXfer;

    /* Write enable */
    status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, 0);

    if (kStatus_Success == status)
    {
        /* Send erase chip command. */
        flashXfer.deviceAddress = 0;
        flashXfer.port          = port;
        flashXfer.cmdType       = kFLEXSPI_Command;
        flashXfer.SeqNumber     = 1;
        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_CHIPERASE;

        status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

        if (kStatus_Success == status)
        {
            status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, 0);
        }
    }

    /* Do software reset. */
    FLEXSPI_SoftwareReset((FLEXSPI_Type *)handle->driverBaseAddr);

    return status;
}

status_t Nor_Flash_Erase_Block(nor_handle_t *handle, uint32_t address)
{
    assert(handle != NULL);

    status_t status                     = kStatus_InvalidArgument;
    flexspi_mem_nor_handle_t *memHandle = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                 = memHandle->port;
    flexspi_transfer_t flashXfer;

    /* Write enable */
    status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, address);

    if (kStatus_Success == status)
    {
        /* Send erase block command. */
        flashXfer.deviceAddress = address;
        flashXfer.port          = port;
        flashXfer.cmdType       = kFLEXSPI_Command;
        flashXfer.SeqNumber     = 1;
        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_ERASEBLOCK;

        status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

        if (kStatus_Success == status)
        {
            status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, address);
        }
    }

    /* Do software reset. */
    FLEXSPI_SoftwareReset((FLEXSPI_Type *)handle->driverBaseAddr);

    return status;
}

status_t Nor_Flash_Erase_Sector(nor_handle_t *handle, uint32_t address)
{
    assert(handle != NULL);

    status_t status                     = kStatus_InvalidArgument;
    flexspi_mem_nor_handle_t *memHandle = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                 = memHandle->port;
    flexspi_transfer_t flashXfer;

    /* Write enable */
    status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, address);

    if (kStatus_Success == status)
    {
        /* Send erase sector command. */
        flashXfer.deviceAddress = address;
        flashXfer.port          = port;
        flashXfer.cmdType       = kFLEXSPI_Command;
        flashXfer.SeqNumber     = 1;
        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_ERASESECTOR;

        status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

        if (kStatus_Success == status)
        {
            status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, address);
        }
    }

    /* Do software reset. */
    FLEXSPI_SoftwareReset((FLEXSPI_Type *)handle->driverBaseAddr);

    return status;
}

status_t Nor_Flash_Erase(nor_handle_t *handle, uint32_t address, uint32_t size_Byte)
{
    assert(handle != NULL);
    assert(size_Byte > 0x00U);
    uint32_t startAddress = address;
    status_t status       = kStatus_Success;

    for (uint32_t i = 0x00U; i <= (size_Byte / handle->bytesInSectorSize); i++)
    {
        status = Nor_Flash_Erase_Sector(handle, startAddress);
        startAddress += handle->bytesInSectorSize;
    }

    return status;
}

status_t Nor_Flash_Page_Program(nor_handle_t *handle, uint32_t address, uint8_t *buffer)
{
    assert(handle != NULL);
    assert(buffer != NULL);

    status_t status = kStatus_InvalidArgument;
    flexspi_transfer_t flashXfer;
    flexspi_mem_nor_handle_t *memHandle = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                 = memHandle->port;
    uint32_t pageSize                   = handle->bytesInPageSize;

    /* To make sure external flash be in idle status, added wait for busy before program data for
       an external flash without RWW(read while write) attribute.*/
    status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, address);

    if (kStatus_Success != status)
    {
        return status;
    }

    /* Write enable. */
    status = FLEXSPI_NOR_WriteEnable((FLEXSPI_Type *)handle->driverBaseAddr, port, address);

    if (kStatus_Success == status)
    {
        /* Send page program command. */
        flashXfer.deviceAddress = address;
        flashXfer.port          = port;
        flashXfer.cmdType       = kFLEXSPI_Write;
        flashXfer.SeqNumber     = 1;
        flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM;
        flashXfer.data          = (uint32_t *)(void *)buffer;
        flashXfer.dataSize      = pageSize;

        status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

        if (kStatus_Success == status)
        {
            status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, address);
        }
    }

