lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/flash/nor/flexspi/fsl_flexspi_nor_flash.c
    return status;
}

status_t Nor_Flash_Program(nor_handle_t *handle, uint32_t address, uint8_t *buffer, uint32_t length)
{
    assert(handle != NULL);
    assert(buffer != NULL);
    uint32_t startAddress = address;
    status_t status       = kStatus_Success;

    for (uint32_t i = 0x00U; i <= (length / handle->bytesInPageSize); i++)
    {
        status = Nor_Flash_Page_Program(handle, startAddress, buffer);
        /* Avoid buffer overflow. */
        if (length >= handle->bytesInPageSize)
        {
            buffer += handle->bytesInPageSize;
            startAddress += handle->bytesInPageSize;
        }
    }

    return status;
}

status_t Nor_Flash_Read(nor_handle_t *handle, uint32_t address, uint8_t *buffer, uint32_t length)
{
    assert(handle != NULL);
    assert(buffer != NULL);

    status_t status = kStatus_InvalidArgument;
    flexspi_transfer_t flashXfer;
    flexspi_mem_nor_handle_t *memHandle = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_port_t port                 = memHandle->port;

    /* Read page. */
    flashXfer.deviceAddress = address;
    flashXfer.port          = port;
    flashXfer.cmdType       = kFLEXSPI_Read;
    flashXfer.SeqNumber     = 1;
    flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READ;
    flashXfer.data          = (uint32_t *)(void *)buffer;
    flashXfer.dataSize      = length;

    status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

    if (kStatus_Success == status)
    {
        status = FLEXSPI_NOR_WaitBusBusy((FLEXSPI_Type *)handle->driverBaseAddr, memHandle, address);
    }

    return status;
}

status_t Nor_Flash_Init(nor_config_t *config, nor_handle_t *handle)
{
    assert(config != NULL);
    assert(handle != NULL);

    status_t status                      = kStatus_InvalidArgument;
    flexspi_mem_config_t *memConfig      = (flexspi_mem_config_t *)config->memControlConfig;
    handle->driverBaseAddr               = config->driverBaseAddr;
    handle->deviceSpecific               = &flexspiMemHandle;
    flexspiMemHandle.configuredFlashSize = memConfig->deviceConfig.flashSize;
    flexspiMemHandle.port                = memConfig->devicePort;
    flexspi_config_t flexspiConfig;

#if defined(__ICACHE_PRESENT) && (__ICACHE_PRESENT == 1U)
    bool ICacheEnableFlag = false;
    /* Disable I cache. */
    if (SCB_CCR_IC_Msk == (SCB_CCR_IC_Msk & SCB->CCR))
    {
        SCB_DisableICache();
        ICacheEnableFlag = true;
    }
#endif /* __ICACHE_PRESENT */

#if defined(__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
    bool DCacheEnableFlag = false;
    /* Disable D cache. */
    if (SCB_CCR_DC_Msk == (SCB_CCR_DC_Msk & SCB->CCR))
    {
        SCB_DisableDCache();
        DCacheEnableFlag = true;
    }
#endif /* __DCACHE_PRESENT */

    /* Get FLEXSPI default settings and configure the flexspi. */
    FLEXSPI_GetDefaultConfig(&flexspiConfig);

    /*Set AHB buffer size for reading data through AHB bus. */
    flexspiConfig.ahbConfig.enableAHBPrefetch    = true;
    flexspiConfig.ahbConfig.enableAHBBufferable  = true;
    flexspiConfig.ahbConfig.enableReadAddressOpt = true;
    flexspiConfig.ahbConfig.enableAHBCachable    = true;
    flexspiConfig.rxSampleClock                  = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
    FLEXSPI_Init((FLEXSPI_Type *)handle->driverBaseAddr, &flexspiConfig);

    FLEXSPI_NOR_Memset(memConfig->lookupTable, 0U, sizeof(memConfig->lookupTable));

    /* Configure flash settings according to serial flash feature. */
    FLEXSPI_SetFlashConfig((FLEXSPI_Type *)handle->driverBaseAddr, &(memConfig->deviceConfig), memConfig->devicePort);

    /* Initialize LUT table. */
    FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, 0, memConfig->lookupTable,
                      sizeof(memConfig->lookupTable) / sizeof(memConfig->lookupTable[0]));

    status = FLEXSPI_NOR_GenerateConfigBlockUsingSFDP(handle, memConfig);

    if (kStatus_Success == status)
    {
        /* Update LUT table. */
        FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, 0, memConfig->lookupTable,
                          sizeof(memConfig->lookupTable) / sizeof(memConfig->lookupTable[0]));

        /* Do software reset. */
        FLEXSPI_SoftwareReset((FLEXSPI_Type *)handle->driverBaseAddr);
    }

#if defined(__ICACHE_PRESENT) && (__ICACHE_PRESENT == 1U)
    if (ICacheEnableFlag)
    {
        /* Enable I cache. */
        SCB_EnableICache();
    }
#endif /* __ICACHE_PRESENT */

#if defined(__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
    if (DCacheEnableFlag)
    {
        /* Enable D cache. */
        SCB_EnableDCache();
    }
#endif /* __DCACHE_PRESENT */

    return status;
}

status_t Nor_Flash_DeInit(nor_handle_t *handle)
{
    status_t status = kStatus_Success;

    /* Reset peripheral. */
    FLEXSPI_SoftwareReset((FLEXSPI_Type *)handle->driverBaseAddr);

    return status;
}

status_t Nor_Flash_Is_Busy(nor_handle_t *handle, bool *isBusy)
{
    bool busy = true;
    uint32_t readValue;
    status_t status                     = kStatus_InvalidArgument;
    flexspi_mem_nor_handle_t *memHandle = (flexspi_mem_nor_handle_t *)handle->deviceSpecific;
    flexspi_transfer_t flashXfer;

    flashXfer.deviceAddress = 0x00U;
    flashXfer.port          = memHandle->port;
    flashXfer.cmdType       = kFLEXSPI_Read;
    flashXfer.SeqNumber     = 1;
    flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_READSTATUS;
    flashXfer.data          = &readValue;
    flashXfer.dataSize      = 1;

    status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

    if (status != kStatus_Success)
    {
        return status;
    }

    if (memHandle->busyBitPolarity == 0x01U)
    {
        busy = (((~readValue) & (0x01UL << memHandle->busyOffset)) == (0x01UL << memHandle->busyOffset)) ? true : false;
    }
    else
    {
        busy = ((readValue & (0x01UL << memHandle->busyOffset)) == (0x01UL << memHandle->busyOffset)) ? true : false;
    }

    *isBusy = busy;

    return status;
}

status_t FLEXSPI_NOR_ExitNoCMDMode(nor_handle_t *handle, flexspi_mem_config_t *config, uint32_t baseAddr)
{
    assert(config != NULL);
    assert(handle != NULL);

    status_t status = kStatus_InvalidArgument;
    flexspi_transfer_t flashXfer;
    flashXfer.cmdType       = kFLEXSPI_Command;
    flashXfer.seqIndex      = NOR_CMD_LUT_SEQ_IDX_EXIT_NOCMD;
    flashXfer.SeqNumber     = 1;
    flashXfer.deviceAddress = baseAddr;
    flashXfer.port          = flexspiMemHandle.port;

    FLEXSPI_UpdateLUT((FLEXSPI_Type *)handle->driverBaseAddr, NOR_CMD_LUT_SEQ_IDX_EXIT_NOCMD * 4U,
                      &config->lookupTable[4U * flashXfer.seqIndex], 4U);

    status = FLEXSPI_TransferBlocking((FLEXSPI_Type *)handle->driverBaseAddr, &flashXfer);

    return status;
}
